## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.fatp_azure_web_app_services_hosting.azurerm_storage_account.logs[0] has changed
  ~ resource "azurerm_storage_account" "logs" {
        id                                = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-400/providers/Microsoft.Storage/storageAccounts/findatppr400logs"
        name                              = "findatppr400logs"
        tags                              = {
            "Environment"      = "pr-400"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (37 unchanged attributes hidden)

      ~ network_rules {
          ~ ip_rules                   = [
              - "20.49.24.86",
              + "20.168.159.156",
                # (1 unchanged element hidden)
            ]
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.fatp_azure_web_app_services_hosting.data.azurerm_storage_account_blob_container_sas.logs["app"] will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_storage_account_blob_container_sas" "logs" {
      + connection_string = (sensitive value)
      + container_name    = "find-a-tp-pr-400applogs"
      + expiry            = (known after apply)
      + https_only        = true
      + id                = (known after apply)
      + sas               = (sensitive value)
      + start             = (known after apply)

      + permissions {
          + add    = true
          + create = true
          + delete = true
          + list   = true
          + read   = true
          + write  = true
        }
    }

  # module.fatp_azure_web_app_services_hosting.data.azurerm_storage_account_blob_container_sas.logs["http"] will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_storage_account_blob_container_sas" "logs" {
      + connection_string = (sensitive value)
      + container_name    = "find-a-tp-pr-400httplogs"
      + expiry            = (known after apply)
      + https_only        = true
      + id                = (known after apply)
      + sas               = (sensitive value)
      + start             = (known after apply)

      + permissions {
          + add    = true
          + create = true
          + delete = true
          + list   = true
          + read   = true
          + write  = true
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_application_insights.function_app_service will be created
  + resource "azurerm_application_insights" "function_app_service" {
      + app_id                                = (known after apply)
      + application_type                      = "web"
      + connection_string                     = (sensitive value)
      + daily_data_cap_in_gb                  = (known after apply)
      + daily_data_cap_notifications_disabled = (known after apply)
      + disable_ip_masking                    = false
      + force_customer_storage_for_profiler   = false
      + id                                    = (known after apply)
      + instrumentation_key                   = (sensitive value)
      + internet_ingestion_enabled            = true
      + internet_query_enabled                = true
      + local_authentication_disabled         = false
      + location                              = "westeurope"
      + name                                  = "find-a-tp-pr-400-insights-fa"
      + resource_group_name                   = "s177d01-ntp-pr-400"
      + retention_in_days                     = 30
      + sampling_percentage                   = 100
      + tags                                  = {
          + "Environment"      = "pr-400"
          + "Product"          = "National Tutoring Programme"
          + "Service Offering" = "National Tutoring Programme"
        }
      + workspace_id                          = (known after apply)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_key_vault_secret.blobstorageenquiriesdataclientsecret will be created
  + resource "azurerm_key_vault_secret" "blobstorageenquiriesdataclientsecret" {
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-400/providers/Microsoft.KeyVault/vaults/find-a-tp-pr-400-kv"
      + name                    = "BlobStorageEnquiriesData--ClientSecret"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_linux_function_app.default will be created
  + resource "azurerm_linux_function_app" "default" {
      + app_settings                      = (known after apply)
      + builtin_logging_enabled           = true
      + client_certificate_enabled        = false
      + client_certificate_mode           = "Optional"
      + content_share_force_disabled      = false
      + custom_domain_verification_id     = (sensitive value)
      + daily_memory_time_quota           = 0
      + default_hostname                  = (known after apply)
      + enabled                           = true
      + functions_extension_version       = "~4"
      + https_only                        = true
      + id                                = (known after apply)
      + key_vault_reference_identity_id   = (known after apply)
      + kind                              = (known after apply)
      + location                          = "westeurope"
      + name                              = "find-a-tp-pr-400-fa"
      + outbound_ip_address_list          = (known after apply)
      + outbound_ip_addresses             = (known after apply)
      + possible_outbound_ip_address_list = (known after apply)
      + possible_outbound_ip_addresses    = (known after apply)
      + resource_group_name               = "s177d01-ntp-pr-400"
      + service_plan_id                   = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-400/providers/Microsoft.Web/serverfarms/find-a-tp-pr-400"
      + site_credential                   = (known after apply)
      + storage_account_access_key        = (sensitive value)
      + storage_account_name              = "findatppr400falogs"
      + storage_uses_managed_identity     = false
      + tags                              = {
          + "Environment"      = "pr-400"
          + "Product"          = "National Tutoring Programme"
          + "Service Offering" = "National Tutoring Programme"
        }
      + virtual_network_subnet_id         = (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + site_config {
          + always_on                               = true
          + app_scale_limit                         = (known after apply)
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + elastic_instance_minimum                = (known after apply)
          + ftps_state                              = "Disabled"
          + health_check_eviction_time_in_min       = (known after apply)
          + http2_enabled                           = true
          + ip_restriction                          = [
              + {
                  + action      = "Allow"
                  + headers     = [
                      + {
                          + x_azure_fdid = [
                              + "82dfc3be-eaee-4137-aeda-72fccb723d68",
                            ]
                        },
                    ]
                  + name        = "Allow CDN Traffic"
                  + priority    = 65000
                  + service_tag = "AzureFrontDoor.Backend"
                },
            ]
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + pre_warmed_instance_count               = (known after apply)
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_ip_restriction                      = (known after apply)
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = false
          + vnet_route_all_enabled                  = true
          + websockets_enabled                      = false
          + worker_count                            = 3

          + application_stack {
              + dotnet_version              = "6.0"
              + use_dotnet_isolated_runtime = true
            }
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_linux_web_app.default[0] will be updated in-place
  ~ resource "azurerm_linux_web_app" "default" {
        id                                = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-400/providers/Microsoft.Web/sites/find-a-tp-pr-400"
        name                              = "find-a-tp-pr-400"
        tags                              = {
            "Environment"      = "pr-400"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (19 unchanged attributes hidden)

      ~ logs {
            # (2 unchanged attributes hidden)

          ~ application_logs {
                # (1 unchanged attribute hidden)

              ~ azure_blob_storage {
                  ~ sas_url           = (sensitive value)
                    # (2 unchanged attributes hidden)
                }
            }

          ~ http_logs {
              ~ azure_blob_storage {
                  ~ sas_url           = (sensitive value)
                    # (1 unchanged attribute hidden)
                }
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_log_analytics_workspace.function_app_service will be created
  + resource "azurerm_log_analytics_workspace" "function_app_service" {
      + allow_resource_only_permissions    = true
      + daily_quota_gb                     = -1
      + id                                 = (known after apply)
      + internet_ingestion_enabled         = true
      + internet_query_enabled             = true
      + local_authentication_disabled      = false
      + location                           = "westeurope"
      + name                               = "find-a-tp-pr-400-functionappservice"
      + primary_shared_key                 = (sensitive value)
      + reservation_capacity_in_gb_per_day = (known after apply)
      + resource_group_name                = "s177d01-ntp-pr-400"
      + retention_in_days                  = 30
      + secondary_shared_key               = (sensitive value)
      + sku                                = "PerGB2018"
      + tags                               = {
          + "Environment"      = "pr-400"
          + "Product"          = "National Tutoring Programme"
          + "Service Offering" = "National Tutoring Programme"
        }
      + workspace_id                       = (known after apply)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_diagnostic_setting.default_key_vault[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "default_key_vault" {
        id                             = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-400/providers/Microsoft.KeyVault/vaults/find-a-tp-pr-400-kv|find-a-tp-pr-400-default-kv-diag"
      + log_analytics_destination_type = "Dedicated"
        name                           = "find-a-tp-pr-400-default-kv-diag"
        # (2 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_diagnostic_setting.default_postgresql_flexible_server[0] will be created
  + resource "azurerm_monitor_diagnostic_setting" "default_postgresql_flexible_server" {
      + id                             = (known after apply)
      + log_analytics_destination_type = "Dedicated"
      + log_analytics_workspace_id     = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-400/providers/Microsoft.OperationalInsights/workspaces/find-a-tp-pr-400-webappservice"
      + name                           = "find-a-tp-pr-400-postgresql-diag"
      + target_resource_id             = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-400/providers/Microsoft.DBforPostgreSQL/flexibleServers/find-a-tp-pr-400-psqlflexible-server"

      + enabled_log {
          + category = "PostgreSQLFlexDatabaseXacts"

          + retention_policy {
              + days    = 30
              + enabled = true
            }
        }
      + enabled_log {
          + category = "PostgreSQLFlexQueryStoreRuntime"

          + retention_policy {
              + days    = 30
              + enabled = true
            }
        }
      + enabled_log {
          + category = "PostgreSQLFlexQueryStoreWaitStats"

          + retention_policy {
              + days    = 30
              + enabled = true
            }
        }
      + enabled_log {
          + category = "PostgreSQLFlexSessions"

          + retention_policy {
              + days    = 30
              + enabled = true
            }
        }
      + enabled_log {
          + category = "PostgreSQLFlexTableStats"

          + retention_policy {
              + days    = 30
              + enabled = true
            }
        }
      + enabled_log {
          + category = "PostgreSQLLogs"

          + retention_policy {
              + days    = 30
              + enabled = true
            }
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = true

          + retention_policy {
              + days    = 30
              + enabled = true
            }
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_diagnostic_setting.default_redis_cache[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "default_redis_cache" {
        id                             = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-400/providers/Microsoft.Cache/redis/find-a-tp-pr-400-redis-cache|find-a-tp-pr-400-default-redis-diag"
      + log_analytics_destination_type = "Dedicated"
        name                           = "find-a-tp-pr-400-default-redis-diag"
        # (2 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_diagnostic_setting.function_app[0] will be created
  + resource "azurerm_monitor_diagnostic_setting" "function_app" {
      + id                             = (known after apply)
      + log_analytics_destination_type = "Dedicated"
      + log_analytics_workspace_id     = (known after apply)
      + name                           = "find-a-tp-pr-400-storage-diag-fa"
      + target_resource_id             = (known after apply)

      + metric {
          + category = "Transaction"
          + enabled  = true

          + retention_policy {
              + enabled = false
            }
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_diagnostic_setting.function_app_service will be created
  + resource "azurerm_monitor_diagnostic_setting" "function_app_service" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = (known after apply)
      + name                           = "find-a-tp-pr-400-functionappservice"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category = "FunctionAppLogs"

          + retention_policy {
              + days    = 30
              + enabled = true
            }
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = true

          + retention_policy {
              + days    = 30
              + enabled = true
            }
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_diagnostic_setting.web_app[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "web_app" {
        id                             = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-400/providers/Microsoft.Storage/storageAccounts/findatppr400logs|find-a-tp-pr-400-storage-diag"
      + log_analytics_destination_type = "Dedicated"
        name                           = "find-a-tp-pr-400-storage-diag"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "Capacity" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - metric {
          - category = "Transaction" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      + metric {
          + category = "Transaction"
          + enabled  = true

          + retention_policy {
              + enabled = false
            }
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_diagnostic_setting.webhook[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "webhook" {
        id                             = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-400/providers/Microsoft.Logic/workflows/find-a-tp-pr-400-webhook-workflow|find-a-tp-pr-400-webhook-diag"
      + log_analytics_destination_type = "Dedicated"
        name                           = "find-a-tp-pr-400-webhook-diag"
        # (2 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_scheduled_query_rules_alert.data_extraction_fa_error_alert[0] will be created
  + resource "azurerm_monitor_scheduled_query_rules_alert" "data_extraction_fa_error_alert" {
      + auto_mitigation_enabled = true
      + data_source_id          = (known after apply)
      + description             = "This rule triggers when the function DataExtraction has encountered an error in a FaTP environment."
      + enabled                 = true
      + frequency               = 5
      + id                      = (known after apply)
      + location                = "westeurope"
      + name                    = "find-a-tp-pr-400-fa-data-extraction-errors"
      + query                   = <<-EOT
            requests
            | project
              timestamp,
              id,
              operation_Name,
              success,
              resultCode,
              duration,
              operation_Id,
              cloud_RoleName,
              invocationId=customDimensions['InvocationId']
            | where timestamp > ago(1d)
            | where operation_Name =~ 'DataExtraction'
            | where cloud_RoleName !endswith 'fa-staging'
            | where success == false
            | order by timestamp desc
            | take 1
        EOT
      + query_type              = "ResultCount"
      + resource_group_name     = "s177d01-ntp-pr-400"
      + severity                = 0
      + tags                    = {
          + "Environment"      = "pr-400"
          + "Product"          = "National Tutoring Programme"
          + "Service Offering" = "National Tutoring Programme"
        }
      + time_window             = 6

      + action {
          + action_group = [
              + "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-400/providers/Microsoft.Insights/actionGroups/find-a-tp-pr-400-actiongroup",
            ]
        }

      + trigger {
          + operator  = "Equal"
          + threshold = 1
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_scheduled_query_rules_alert.email_processing_fa_error_alert[0] will be created
  + resource "azurerm_monitor_scheduled_query_rules_alert" "email_processing_fa_error_alert" {
      + auto_mitigation_enabled = true
      + data_source_id          = (known after apply)
      + description             = "This rule triggers when the function PollEmailProcessing has encountered an error in a FaTP environment."
      + enabled                 = true
      + frequency               = 5
      + id                      = (known after apply)
      + location                = "westeurope"
      + name                    = "find-a-tp-pr-400-fa-email-processing-errors"
      + query                   = <<-EOT
            requests
            | project
              timestamp,
              id,
              operation_Name,
              success,
              resultCode,
              duration,
              operation_Id,
              cloud_RoleName,
              invocationId=customDimensions['InvocationId']
            | where timestamp > ago(2m)
            | where operation_Name =~ 'PollEmailProcessing'
            | where cloud_RoleName !endswith 'fa-staging'
            | where success == false
            | order by timestamp desc
            | take 1
        EOT
      + query_type              = "ResultCount"
      + resource_group_name     = "s177d01-ntp-pr-400"
      + severity                = 0
      + tags                    = {
          + "Environment"      = "pr-400"
          + "Product"          = "National Tutoring Programme"
          + "Service Offering" = "National Tutoring Programme"
        }
      + time_window             = 6

      + action {
          + action_group = [
              + "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-400/providers/Microsoft.Insights/actionGroups/find-a-tp-pr-400-actiongroup",
            ]
        }

      + trigger {
          + operator  = "Equal"
          + threshold = 1
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_scheduled_query_rules_alert.function_app_down_alert[0] will be created
  + resource "azurerm_monitor_scheduled_query_rules_alert" "function_app_down_alert" {
      + auto_mitigation_enabled = true
      + data_source_id          = (known after apply)
      + description             = "This rule triggers when the function app is down in a FaTP environment."
      + enabled                 = true
      + frequency               = 5
      + id                      = (known after apply)
      + location                = "westeurope"
      + name                    = "find-a-tp-pr-400-faapp-down"
      + query                   = <<-EOT
            requests
            | project
              timestamp,
              id,
              operation_Name,
              success,
              resultCode,
              duration,
              operation_Id,
              cloud_RoleName,
              invocationId=customDimensions['InvocationId']
            | where timestamp > ago(10m)
            | order by timestamp desc
            | take 1
        EOT
      + query_type              = "ResultCount"
      + resource_group_name     = "s177d01-ntp-pr-400"
      + severity                = 0
      + tags                    = {
          + "Environment"      = "pr-400"
          + "Product"          = "National Tutoring Programme"
          + "Service Offering" = "National Tutoring Programme"
        }
      + time_window             = 6

      + action {
          + action_group = [
              + "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-400/providers/Microsoft.Insights/actionGroups/find-a-tp-pr-400-actiongroup",
            ]
        }

      + trigger {
          + operator  = "Equal"
          + threshold = 0
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_scheduled_query_rules_alert.web_app_service[0] will be updated in-place
  ~ resource "azurerm_monitor_scheduled_query_rules_alert" "web_app_service" {
        id                      = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-400/providers/Microsoft.Insights/scheduledQueryRules/find-a-tp-pr-400-webapp-errors"
        name                    = "find-a-tp-pr-400-webapp-errors"
      ~ query                   = <<-EOT
            traces
          - | union requests
          - | where resultCode == "500" or severityLevel == 3
          + | union requests, exceptions
          + | where (resultCode == "500" or severityLevel == 3)
            | where timestamp > ago(5m)
            | order by timestamp desc
            | take 1
        EOT
        tags                    = {
            "Environment"      = "pr-400"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_resource_group.default[0] will be updated in-place
  ~ resource "azurerm_resource_group" "default" {
        id       = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-400"
        name     = "s177d01-ntp-pr-400"
      ~ tags     = {
          ~ "Environment"      = "Dev" -> "pr-400"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (1 unchanged attribute hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_storage_account.functionapplogs[0] will be created
  + resource "azurerm_storage_account" "functionapplogs" {
      + access_tier                       = (known after apply)
      + account_kind                      = "StorageV2"
      + account_replication_type          = "LRS"
      + account_tier                      = "Standard"
      + allow_nested_items_to_be_public   = true
      + cross_tenant_replication_enabled  = true
      + default_to_oauth_authentication   = false
      + enable_https_traffic_only         = true
      + id                                = (known after apply)
      + infrastructure_encryption_enabled = false
      + is_hns_enabled                    = false
      + large_file_share_enabled          = (known after apply)
      + location                          = "westeurope"
      + min_tls_version                   = "TLS1_2"
      + name                              = "findatppr400falogs"
      + nfsv3_enabled                     = false
      + primary_access_key                = (sensitive value)
      + primary_blob_connection_string    = (sensitive value)
      + primary_blob_endpoint             = (known after apply)
      + primary_blob_host                 = (known after apply)
      + primary_connection_string         = (sensitive value)
      + primary_dfs_endpoint              = (known after apply)
      + primary_dfs_host                  = (known after apply)
      + primary_file_endpoint             = (known after apply)
      + primary_file_host                 = (known after apply)
      + primary_location                  = (known after apply)
      + primary_queue_endpoint            = (known after apply)
      + primary_queue_host                = (known after apply)
      + primary_table_endpoint            = (known after apply)
      + primary_table_host                = (known after apply)
      + primary_web_endpoint              = (known after apply)
      + primary_web_host                  = (known after apply)
      + public_network_access_enabled     = true
      + queue_encryption_key_type         = "Service"
      + resource_group_name               = "s177d01-ntp-pr-400"
      + secondary_access_key              = (sensitive value)
      + secondary_blob_connection_string  = (sensitive value)
      + secondary_blob_endpoint           = (known after apply)
      + secondary_blob_host               = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_dfs_endpoint            = (known after apply)
      + secondary_dfs_host                = (known after apply)
      + secondary_file_endpoint           = (known after apply)
      + secondary_file_host               = (known after apply)
      + secondary_location                = (known after apply)
      + secondary_queue_endpoint          = (known after apply)
      + secondary_queue_host              = (known after apply)
      + secondary_table_endpoint          = (known after apply)
      + secondary_table_host              = (known after apply)
      + secondary_web_endpoint            = (known after apply)
      + secondary_web_host                = (known after apply)
      + sftp_enabled                      = false
      + shared_access_key_enabled         = true
      + table_encryption_key_type         = "Service"
      + tags                              = {
          + "Environment"      = "pr-400"
          + "Product"          = "National Tutoring Programme"
          + "Service Offering" = "National Tutoring Programme"
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_storage_account_network_rules.logs[0] will be updated in-place
  ~ resource "azurerm_storage_account_network_rules" "logs" {
        id                         = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-400/providers/Microsoft.Storage/storageAccounts/findatppr400logs"
      ~ ip_rules                   = [
          - "20.168.159.156",
            # (1 unchanged element hidden)
        ]
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_subnet.function_app_service_infra_subnet[0] will be created
  + resource "azurerm_subnet" "function_app_service_infra_subnet" {
      + address_prefixes                               = [
          + "10.0.10.0/23",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "find-a-tp-pr-400-functionappserviceinfra"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "s177d01-ntp-pr-400"
      + service_endpoints                              = [
          + "Microsoft.Storage",
        ]
      + virtual_network_name                           = "find-a-tp-pr-400-default"

      + delegation {
          + name = "delegation"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/action",
                ]
              + name    = "Microsoft.Web/serverFarms"
            }
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_subnet_nat_gateway_association.function_app_service[0] will be created
  + resource "azurerm_subnet_nat_gateway_association" "function_app_service" {
      + id             = (known after apply)
      + nat_gateway_id = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-400/providers/Microsoft.Network/natGateways/find-a-tp-pr-400-default"
      + subnet_id      = (known after apply)
    }

Plan: 13 to add, 8 to change, 0 to destroy.
```
</details>